wisteria-1c/Конфигурация/InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УсловиеПредоставленияСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

wisteria-1c/Конфигурация/CommonModules/ИнтеграцияМОТПУНФКлиент/Ext/Module.bsl
#Область ШтрихкодированиеИСКлиентПереопределяемый

// В процедуре нужно показать диалоговое окно для ввода штрихкода и передать полученные данные в описание оповещения.
//
// Параметры:
//  Оповещение - ОписаниеОповещения - процедура, которую нужно вызвать после ввода штрихкода.
//
Процедура ПоказатьВводШтрихкода(Оповещение) Экспорт
	
	ДополнительныеПараметры = Новый Структура(
		"ОповещениеУспешногоВвода",
		Оповещение);
	ОповещениеВвода = Новый ОписаниеОповещения(
		"ПоказатьВводШтрихкодаЗавершение",
		ЭтотОбъект,
		ДополнительныеПараметры);
	ПоказатьВводЗначения(ОповещениеВвода, "", НСтр("ru = 'Введите штрихкод'"));
	
КонецПроцедуры

// В процедуре необходимо реализовать алгоритм обработки
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
Процедура ПослеОбработкиШтрихкодов(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	СтруктураДействий = ОбработанныеДанные;
	Если НЕ СтруктураДействий.Свойство("НеизвестныеШтрихкоды") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДействий.НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		// Для тех, у кого есть профиль "Рабочее место кассира" мы не разрешаем регистрацию штрихкодов
		ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
		Если ПараметрыРаботыКлиента.Свойство("ЕстьПрофильРМК") И ПараметрыРаботыКлиента.ЕстьПрофильРМК Тогда
			ОповеститьОНенайденныхШтрихкодах(СтруктураДействий.НеизвестныеШтрихкоды);
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура("Форма, КэшированныеЗначения", Форма, КэшированныеЗначения);
		ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьНеизвестныеШтрихкодыЗавершение", ШтрихкодированиеИСКлиент, ДополнительныеПараметры);
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			СтруктураДействий, Форма,,,, ОписаниеОповещения);
			
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьКэшированныеШтрихкоды(ДанныеШтрихкодов, КэшированныеЗначения) Экспорт
	
	КэшированныеЗначения.Очистить();
	
КонецПроцедуры

// Вызывается после загрузки данных из ТСД. В процедуре нужно проанализировать полученные штрихкоды на предмет
// сканирования акцизной марки, а также обработать штрихкоды, не привязанные к номенклатуре.
//
// Параметры:
//  Форма - УправляемаяФорма - форма документа, в которой были обработаны штрихкоды,
//  ОбработанныеДанные - Структура - подготовленные ранее данные штрихкодов,
//  КэшированныеЗначения - Структура - используется механизмом обработки изменения реквизитов ТЧ.
Процедура ПослеОбработкиТаблицыТоваровПолученнойИзТСД(Форма, ОбработанныеДанные, КэшированныеЗначения) Экспорт
	
	СтруктураДействий = ОбработанныеДанные;
	
	ОповеститьОНенайденныхШтрихкодах(СтруктураДействий.НеизвестныеШтрихкоды);
	
	Если СтруктураДействий.ТекущаяСтрока <> Неопределено Тогда
		Форма.Элементы.Запасы.ТекущаяСтрока = СтруктураДействий.ТекущаяСтрока;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьДанныеДляОбработкиТаблицыТоваровПолученнойИзТСД(
	Форма, ТаблицаТоваров, КэшированныеЗначения, ПараметрыЗаполнения, СтруктураДействий) Экспорт
	
	ПараметрыЗаполненияНоменклатурыЕГАИС = Новый Структура;
	ПараметрыЗаполненияНоменклатурыЕГАИС.Вставить("ЗаполнитьФлагАлкогольнаяПродукция", Ложь);
	ПараметрыЗаполненияНоменклатурыЕГАИС.Вставить("ИмяКолонки", "НоменклатураЕГАИС");
	
	СтруктураДействийСДобавленнымиСтроками = Новый Структура;
	СтруктураДействийСДобавленнымиСтроками.Вставить("ЗаполнитьНоменклатуруЕГАИС", ПараметрыЗаполненияНоменклатурыЕГАИС);
	Если ПараметрыЗаполнения.ПересчитатьКоличествоЕдиниц Тогда
		СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьКоличествоЕдиниц");
	КонецЕсли;
	Если ПараметрыЗаполнения.ПересчитатьСумму Тогда
		СтруктураДействийСДобавленнымиСтроками.Вставить("ПересчитатьСумму");
	КонецЕсли;
	
	СтруктураДействийСИзмененнымиСтроками = Новый Структура;
	Если ПараметрыЗаполнения.ПересчитатьКоличествоЕдиниц Тогда
		СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьКоличествоЕдиниц");
	КонецЕсли;
	Если ПараметрыЗаполнения.ПересчитатьСумму Тогда
		СтруктураДействийСИзмененнымиСтроками.Вставить("ПересчитатьСумму");
	КонецЕсли;
	
	СтруктураДействий = ИнтеграцияМОТПУНФКлиентСервер.ПараметрыОбработкиШтрихкодов();
	
	СтруктураДействий.Штрихкоды                               = ТаблицаТоваров;
	СтруктураДействий.СтруктураДействийСДобавленнымиСтроками  = СтруктураДействийСДобавленнымиСтроками;
	СтруктураДействий.СтруктураДействийСИзмененнымиСтроками   = СтруктураДействийСИзмененнымиСтроками;
	СтруктураДействий.ТолькоТовары                            = Истина;
	СтруктураДействий.ШтрихкодыВТЧ                            = ПараметрыЗаполнения.ШтрихкодыВТЧ;
	СтруктураДействий.МаркируемаяПродукцияВТЧ                 = ПараметрыЗаполнения.МаркируемаяПродукцияВТЧ;
	СтруктураДействий.ЗагрузкаИзТСД                           = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаИПодборПродукцииМОТПКлиентПереопределяемый

// Заполняет специфичные параметры открытия формы проверки и подбора табачной продукции в зависимости от точки вызова
//
// Параметры:
//  Форма - УправляемаяФорма - форма из которой происходит открытие формы проверки и подбора
//  Параметры - (См. ПроверкаИПодборПродукцииМОТПКлиентСервер.ПараметрыОткрытияФормыПроверкиИПодбора)
Процедура ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, Параметры) Экспорт
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекККМ")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекККМВозврат") Тогда
		
		Параметры.ПроверятьМодифицированность   = Ложь;
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиница";
		Параметры.ИмяРеквизитаКонтрагент        = "";
		Параметры.Склад                         = Форма.Объект.СтруктурнаяЕдиница;
		Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
		Параметры.ОрганизацияЕГАИС = ИнтеграцияЕГАИСУНФВызовСервера.ОрганизацияЕГАИСПоОрганизацииИТорговомуОбъекту(
			Форма.Объект.Организация,
			Форма.Объект.СтруктурнаяЕдиница);
		
		ПараметрыОповещенияПриЗакрытии = Новый Структура;
		ПараметрыОповещенияПриЗакрытии.Вставить("Форма", Форма);
		
		Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения(
			"ПриЗакрытииФормыПроверкиИПодбора",
			СобытияФормИСУНФКлиент,
			ПараметрыОповещенияПриЗакрытии);
		
		Параметры.АдресПроверяемыхДанных = ИнтеграцияМОТПУНФВызовСервера.АдресДанныхПроверкиМаркируемойПродукцииЧекККМ(
			ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(Форма),
			Форма.Объект,
			Форма.УникальныйИдентификатор);
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.РасходнаяНакладная")
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.КорректировкаРеализации") Тогда
		
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиница";
		Параметры.ИмяРеквизитаКонтрагент        = "";
		Параметры.ЕГАИС  = Ложь;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
		ВидыПродукцииСырье = КонструкторИСМПКлиентСервер.ВидыПродукцииСырьеГИСМТ();
		Если ВидыПродукцииСырье.Количество() Тогда
			
			Для Каждого СтрокаТовары Из Форма.Объект.Запасы Цикл
				
				Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(СтрокаТовары.ВидПродукцииИС) Тогда
					Параметры.ИмяФормыПроверки = "СопоставлениеСырья";
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетОПереработке") Тогда
		
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиница";
		Параметры.ИмяРеквизитаКонтрагент        = "";
		Параметры.ЕГАИС  = Ложь;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
		ВидыПродукцииСырье = КонструкторИСМПКлиентСервер.ВидыПродукцииСырьеГИСМТ();
		Если ВидыПродукцииСырье.Количество() Тогда
			
			Для Каждого СтрокаТовары Из Форма.Объект.Продукция Цикл
				
				Если КонструкторИСМПКлиентСервер.ЭтоСырьеГИСМТ(СтрокаТовары.ВидПродукцииИС) Тогда
					Параметры.ИмяФормыПроверки = "СопоставлениеСырья";
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПередачаТоваровМеждуОрганизациями") Тогда
		
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиница";
		Параметры.ИмяРеквизитаКонтрагент        = "";
		Параметры.ЕГАИС  = Ложь;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЗаказПокупателя") Тогда
		
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиницаРезерв";
		Параметры.ИмяРеквизитаКонтрагент        = "";
		Параметры.ЕГАИС  = Ложь;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ПриходнаяНакладная")
		ИЛИ ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ОтчетПереработчика") Тогда
		
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиница";
		Параметры.ИмяРеквизитаКонтрагент        = "Контрагент";
		Параметры.РежимПодбораСуществующихУпаковок = Ложь;
		Параметры.ЕГАИС  = Ложь;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
	ИначеЕсли ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Обработка.РабочееМестоКассира") Тогда
		
		Параметры.ИмяРеквизитаФормыОбъект = "";
		Параметры.ИмяРеквизитаОрганизация = "ОсновнаяОрганизация";
		
		
		Параметры.ПроверятьМодифицированность   = Ложь;
	//	Параметры.ИмяРеквизитаДокументОснование = "";
	//	Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиница";
	//	Параметры.ИмяРеквизитаКонтрагент        = "";
	//	Параметры.Склад                         = Форма.Объект.СтруктурнаяЕдиница;
	//	Параметры.ЕГАИС  = Истина;
		Параметры.ИСМП   = Истина;
		Параметры.Прочее = Истина;
		
		//Параметры.ОрганизацияЕГАИС = ИнтеграцияЕГАИСУНФВызовСервера.ОрганизацияЕГАИСПоОрганизацииИТорговомуОбъекту(
		//	Форма.Объект.Организация,
		//	Форма.Объект.СтруктурнаяЕдиница);
		//
		ПараметрыОповещенияПриЗакрытии = Новый Структура;
		ПараметрыОповещенияПриЗакрытии.Вставить("Форма", Форма);
		
		Параметры.ОписаниеОповещенияПриЗакрытии = Новый ОписаниеОповещения(
			"ПриЗакрытииФормыПроверкиИПодбора",
			СобытияФормИСУНФКлиент,
			ПараметрыОповещенияПриЗакрытии);
		
		Параметры.АдресПроверяемыхДанных = ИнтеграцияМОТПУНФВызовСервера.АдресДанныхПроверкиМаркируемойПродукцииРМК(
			ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(Форма),
			Форма.Объект,
			Форма.УникальныйИдентификатор);
	
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма,"ПараметрыИнтеграцииГосИС") Тогда
		
		НастройкиИнтеграции = Форма.ПараметрыИнтеграцииГосИС.Получить("ФормаПроверкиИПодбора");
		Если Не (НастройкиИнтеграции = Неопределено) Тогда
			Если ТипЗнч(НастройкиИнтеграции) = Тип("Массив") Тогда
				НастройкиИнтеграции = НастройкиИнтеграции[0];
			КонецЕсли;
			Параметры.ПроверкаЭлектронногоДокумента = НастройкиИнтеграции.ЕстьЭлектронныйДокумент;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполняет специфичные действия после закрытия формы проверки и подбора табачной продукции в зависимости от точки вызова
//
// Параметры:
//  РезультатЗакрытия - Произвольный - результат закрытия формы проверки и подбора
//  ДополнительныеПараметры - Структура с реквизитом Форма (управляемая форма из которой происходил вызов)
//
Процедура ПриЗакрытииФормыПроверкиИПодбора(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Форма.ИмяФормы = "Обработка.РабочееМестоКассира.Форма.ФормаРМК" Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.Прочитать();
	
КонецПроцедуры

Процедура ПередОткрытиемФормыПроверкиПодбора(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормыПроверки, Отказ) Экспорт
	
	Если ПараметрыФормыПроверки.Свойство("Склад")
		И Не ЗначениеЗаполнено(ПараметрыФормыПроверки.Склад)
		И ЗначениеЗаполнено(ПараметрыФормыПроверки.ПроверяемыйДокумент) Тогда
		
		ПараметрыФормыПроверки.Склад = ИнтеграцияМОТПУНФВызовСервера.ПолучитьСтруктурнуюЕдиницуПоУмолчанию(ПараметрыФормыПроверки.ПроверяемыйДокумент);
		
	КонецЕсли;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекККМ")
		Или ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.ЧекККМВозврат") Тогда
		ПараметрыФормыПроверки.ПроверкаНеПоДокументу = Истина;
	КонецЕсли;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Обработка.РабочееМестоКассира") Тогда
		ПараметрыФормыПроверки.ПроверяемыйДокумент = ПредопределенноеЗначение("Документ.ЧекККМ.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейсСлужебный

Функция ПрименитьКешПоСтроке(Форма, ДанныеСтроки, ДанныеКешаСтроки) Экспорт
	
	КлючСвязиИзменен = ДанныеСтроки.Номенклатура<>ДанныеКешаСтроки.Номенклатура
		ИЛИ ДанныеСтроки.Характеристика<>ДанныеКешаСтроки.Характеристика
		ИЛИ ДанныеСтроки.Серия<>ДанныеКешаСтроки.Серия;
	
	ТабличнаяЧастьТовары = Форма.Объект.Запасы;
	СтруктураПоиска = Новый Структура("Номенклатура,Характеристика,Партия");
	СтруктураПоискаМОТП = Новый Структура("Номенклатура,Характеристика,Серия");

	Если КлючСвязиИзменен И ДанныеКешаСтроки.МаркируемаяПродукцияГосИС Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПоискаМОТП, ДанныеКешаСтроки);
		СтрокиКеша = Форма.ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоискаМОТП);
		Если СтрокиКеша.Количество() Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСтроки.МаркируемаяПродукцияГосИС Тогда
		
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ДанныеСтроки);
		ЗаполнитьЗначенияСвойств(СтруктураПоискаМОТП, ДанныеСтроки);
		СтруктураПоиска.Партия = ДанныеСтроки.Серия;
		СтрокиКеша = Форма.ДанныеШтрихкодовУпаковокГосИС.НайтиСтроки(СтруктураПоискаМОТП);
		СтрокиТовары = ТабличнаяЧастьТовары.НайтиСтроки(СтруктураПоиска);
		КоличествоПоКлючу = 0;
		Для Каждого СтрокаПоКлючу Из СтрокиТовары Цикл
			КоличествоПоКлючу = КоличествоПоКлючу + СтрокаПоКлючу.Количество;
		КонецЦикла;
		Если СтрокиКеша.Количество() = 0 Тогда
			СтатусПроверкиГосИС = 2;
		ИначеЕсли КоличествоПоКлючу = СтрокиКеша[0].Количество Тогда
			СтатусПроверкиГосИС = 1;
		Иначе
			СтатусПроверкиГосИС = 2;
		КонецЕсли;
		Для Каждого СтрокаПоКлючу Из СтрокиТовары Цикл
			СтрокаПоКлючу.СтатусПроверкиГосИС = СтатусПроверкиГосИС;
		КонецЦикла;
		
	Иначе
		ДанныеСтроки.СтатусПроверкиГосИС = 0;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру, которая затем обрабатывается процедурами заполнения ТЧ.
//
// Параметры:
//  Штрихкод - штрихкод, который необходимо обработать.
//  Количество - количество товаров с указанным штрихкодом.
//
// Возвращаемое значение:
//  Структура - Структура со свойствами:
//   * Штрихкод - Строка - Штрихкод.
//   * Количество - Число - Количество.
//
Функция СтруктураДанныхШтрихкода(Штрихкод, Количество)

	Возврат Новый Структура("Штрихкод, Количество", Штрихкод, Количество);

КонецФункции

Процедура ПоказатьВводШтрихкодаЗавершение(Штрихкод, ДополнительныеПараметры) Экспорт
	
	ОповещениеУспешногоВвода = ДополнительныеПараметры.ОповещениеУспешногоВвода;
	
	Если (Штрихкод <> Неопределено) Тогда
		Если Не ПустаяСтрока(Штрихкод) Тогда
			ВыполнитьОбработкуОповещения(
				ОповещениеУспешногоВвода,
				СтруктураДанныхШтрихкода(Штрихкод, 1));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОНенайденныхШтрихкодах(НеизвестныеШтрихкоды)
	
	СтрокаПредупреждения = "";
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		
		СтрокаПредупреждения = СтрокаПредупреждения + СтрокаСообщения + Символы.ПС;
		
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СтрокаПредупреждения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаПредупреждения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
